export const listOfTitles = [
  `Bad Boys for Life`, `Badland`, `Dark Forces`, `Double World`,
  `Enola Holmes`, `Grand Isle`, `Legacy of Lies`, `Pinocchio`,
  `Project Power`, `Rogue`, `Sponge on the Run`, `The Binge`,
  `The Hunt`, `The Innocence`, `The Last Days of American Crime`,
  `The New Mutants`, `The Owners`, `The Paramedic`, `Toxic`, `Venom`,
  `The Tax Collector`, `Playdate with Destiny`, `The Old Guard`, `Guest House`,
  `A Quiet Place Part II`, `Dark Phoenix`, `Extraction`, `The Outpost`, `Monos`,
  `The Angry Birds Movie 2`, `The Addams Family`, `The Pale Door`, `Ava`
];

export const listOfPeople = [
  `Cole Rogers`, `Cameron Cox`, `Anthony Nelson`, `Adam Bryant`, `Austin Rogers`,
  `Colin Howard`, `Xavier Murphy`, `Jordan Miller`, `Hunter Harris`, `Thomas Alexander`,
  `Anthony Rivera`, `Charles Turner`, `Devin Gray`, `Timothy Jones`, `Matthew Carter`,
  `Elijah Johnson`, `Luke Scott`, `Owen Walker`, `Sean Turner`, `Aaron Butler`,
  `Hayden Griffin`, `Seth Rogers`, `Cameron Evans`, `Alexander Flores`, `David Moore`,
  `Jasmine Barnes`, `Samantha Wood`, `Leah Thomas`, `Melanie Lewis`, `Ashley Edwards`,
  `Isabel Smith`, `Abigail Roberts`, `Jordan Thomas`, `Cole Hall`, `Alex Edwards`,
  `Kyle Gray`, `Brian Hill`, `Sebastian Gonzalez`, `Dylan Foster`, `Cameron Taylor`,
  `Jordan Parker`, `Nathaniel Richardson`, `Mason Clark`
];

export const listOfTexts = [
  `Значимость этих проблем настолько очевидна, что консультация с широким активом играет важную роль в формировании новых предложений. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.`,
  `Повседневная практика показывает, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.`,
  `Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия. Значимость этих проблем настолько очевидна, что консультация с широким активом играет важную роль в формировании новых предложений.`,
  `Идейные соображения высшего порядка, а также укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий.`,
  `Внезапно, предприниматели в сети интернет могут быть преданы социально-демократической анафеме. Сложно сказать, почему базовые сценарии поведения пользователей, вне зависимости от их уровня, должны быть разоблачены! В своём стремлении повысить качество жизни, они забывают, что синтетическое тестирование предоставляет широкие возможности для модели развития.`,
  `Равным образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям.`,
  `Таким образом реализация намеченных плановых заданий позволяет оценить значение новых предложений. Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия.`,
  `Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке модели развития.`,
  `Являясь всего лишь частью общей картины, элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе! Значимость этих проблем настолько очевидна, что выбранный нами инновационный путь играет определяющее значение для экономической целесообразности принимаемых решений.`,
  `Противоположная точка зрения подразумевает, что представители современных социальных резервов представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. Сложно сказать, почему сторонники тоталитаризма в науке будут своевременно верифицированы.`,
  `Равным образом, синтетическое тестирование однозначно определяет каждого участника как способного принимать собственные решения касаемо переосмысления внешнеэкономических политик. Сложно сказать, почему представители современных социальных резервов, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе.`,
  `С другой стороны укрепление и развитие структуры обеспечивает участие в формировании систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий.`,
  `В рамках спецификации современных стандартов, стремящиеся вытеснить традиционное производство, нанотехнологии являются только методом политического участия и представлены в исключительно положительном свете. Есть над чем задуматься: некоторые особенности внутренней политики освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, подвергнуты целой серии независимых исследований.`,
  `Равным образом рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.`,
  `С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании позиций, занимаемых участниками в отношении поставленных задач.`,
  `В целом, конечно, постоянный количественный рост и сфера нашей активности однозначно определяет каждого участника как способного принимать собственные решения касаемо своевременного выполнения сверхзадачи. С учётом сложившейся международной обстановки, сложившаяся структура организации говорит о возможностях экспериментов, поражающих по своей масштабности и грандиозности. Есть над чем задуматься: стремящиеся вытеснить традиционное производство, нанотехнологии могут быть указаны как претенденты на роль ключевых факторов.`,
  `Не следует, однако, забывать, что социально-экономическое развитие обеспечивает широкому кругу специалистов участие в формировании переосмысления внешнеэкономических политик. Принимая во внимание показатели успешности, высококачественный прототип будущего проекта обеспечивает актуальность новых предложений.`,
  `Как принято считать, непосредственные участники технического прогресса, превозмогая сложившуюся непростую экономическую ситуацию, описаны максимально подробно. В своём стремлении улучшить пользовательский опыт мы упускаем, что диаграммы связей представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть призваны к ответу.`,
  `Современные технологии достигли такого уровня, что сплочённость команды профессионалов, а также свежий взгляд на привычные вещи - безусловно открывает новые горизонты для форм воздействия. Есть над чем задуматься: многие известные личности призваны к ответу.`,
  `Вот вам яркий пример современных тенденций - высокое качество позиционных исследований требует от нас анализа поэтапного и последовательного развития общества. Внезапно, стремящиеся вытеснить традиционное производство, нанотехнологии будут заблокированы в рамках своих собственных рациональных ограничений.`,
  `Повседневная практика показывает, что граница обучения кадров способствует повышению качества переосмысления внешнеэкономических политик. А ещё явные признаки победы институционализации превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.`,
  `Таким образом, курс на социально-ориентированный национальный проект предполагает независимые способы реализации модели развития. Понимание сути ресурсосберегающих технологий обеспечивает актуальность форм воздействия.`,
  `Господа, внедрение современных методик играет определяющее значение для дальнейших направлений развития! Как уже неоднократно упомянуто, явные признаки победы институционализации превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.`,
  `Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: новая модель организационной деятельности не оставляет шанса для кластеризации усилий. В частности, высокотехнологичная концепция общественного уклада требует анализа благоприятных перспектив.`,
  `Дорогие друзья, начало повседневной работы по формированию позиции напрямую зависит от дальнейших направлений развития проекта.`,
  `Таким образом, сложившаяся структура организации напрямую зависит от соответствующих условий активизации? Разнообразный и богатый опыт социально-экономическое развитие требует от нас системного анализа дальнейших направлений развитая системы массового участия! Повседневная практика показывает, что курс на социально-ориентированный национальный проект создаёт предпосылки качественно новых шагов для системы обучения кадров, соответствующей насущным потребностям!`,
  `Генератор псевдочитабельного текста рыботекста полезен дизайнерам и верстальщикам при наполнении макетов и тестовых сайтов. Данный приём позволяет без лишнего труда создать эффект заполненности сайта текстовым контентом.`,
  `Задача организации, в особенности же консультация с профессионалами из IT влечет за собой процесс внедрения и модернизации направлений прогрессивного развития? Практический опыт показывает, что начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки существующих финансовых и административных условий.`
];

export const getRandomInteger = (a = 0, b = 1) => {
  const lower = Math.ceil(Math.min(a, b));
  const upper = Math.floor(Math.max(a, b));

  return Math.floor(lower + Math.random() * (upper - lower + 1));
};

const shuffle = (originArray) => {
  originArray.forEach((_, index, array) => {
    const randomNumber = getRandomInteger(0, index);
    const valueIndex = array[randomNumber];
    array[randomNumber] = array[index];
    array[index] = valueIndex;
  });

  return originArray;
};

// возвращает первый элемент переданного массива
export const getRandomItemFromList = (mocks) => shuffle(mocks)[0];

export const getImage = (title) => {
  return `img/${title}.jpg`;
};

// получаем уникальный номер объекта
export const generateId = () => Date.now() + parseInt(Math.random() * 10000, 10);


export const randomDate = (dateX, dateY) => {
  const date1 = new Date(dateX).getTime();
  const date2 = new Date(dateY).getTime();

  if (date1 > date2) {
    return new Date(getRandomInteger(date2, date1)).toLocaleDateString();
  } else {
    return new Date(getRandomInteger(date1, date2)).toLocaleDateString();
  }
};
